<a href="https://colab.research.google.com/github/Mardoyan-Gayane/pis/blob/main/New_notepad.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [5]:
import pandas  as pd
import numpy as np
from IPython.display import display

In [6]:
data = pd.read_csv ("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header= None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [13]:
names = ["Id","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe","Class"]
data.columns = names
data = data.drop(columns=["Id"])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [14]:
data['Class'].replace({1:"building_float",
2:"building_non_float",
3:"vehicle_float",
4:"vehicle_non_float", 5:"containers",
6:"tableware",
7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [15]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
  data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      214 non-null    float64
 2   Mg      214 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      214 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      195 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      195 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

# data vizualiation

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      197 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      199 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      195 non-null    float64
 9   Class   199 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [18]:
data.describe

<bound method NDFrame.describe of           RI     Na    Mg    Al     Si     K    Ca    Ba   Fe           Class
0        NaN  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0  building_float
1    1.51761  13.89  3.60   NaN  72.73  0.48  7.83  0.00  0.0             NaN
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0  building_float
3    1.51766  13.21   NaN  1.29  72.61  0.57  8.22  0.00  0.0  building_float
4        NaN  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0  building_float
..       ...    ...   ...   ...    ...   ...   ...   ...  ...             ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0       headlamps
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0       headlamps
211  1.52065    NaN  0.00  2.02  73.42  0.00  8.44  1.64  0.0       headlamps
212  1.51651    NaN  0.00  1.94  73.61  0.00  8.48  1.57  0.0       headlamps
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0       headlamps

[214 rows x 10 columns]>

In [20]:
display(data['Class'].value_counts())
display(data['Class'].describe())

building_non_float    71
building_float        64
headlamps             27
vehicle_float         17
containers            12
tableware              8
Name: Class, dtype: int64

count                    199
unique                     6
top       building_non_float
freq                      71
Name: Class, dtype: object